### Pandas in Python

Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It
provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object,
while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure
with labeled axes (rows and columns).

In [1]:
import pandas as pd

In [2]:
## Series 
## A pandas Series is a one-dementional array like object that can hold any data type. It is similar to a column in a table.

import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series :\n",series)

Series :
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
## Creating a Series from dictionary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print("Series: \n",series_dict)

Series:
 a    1
b    2
c    3
dtype: int64

In [4]:
## Giving dirent indeces
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [5]:
## Dataframe
## creating dataframe from a dictionary of list
data={
    'name':['Ankit','Prakruti','Shweta'],
    'Age':[21,19,12],
    'city':['Agra','Puri','Agra']
}

df=pd.DataFrame(data)
print(df)
print(type(df))

       name  Age  city
0     Ankit   21  Agra
1  Prakruti   19  Puri
2    Shweta   12  Agra
<class 'pandas.core.frame.DataFrame'>

In [6]:
import numpy as np
np.array(df)

array([['Ankit', 21, 'Agra'],
       ['Prakruti', 19, 'Puri'],
       ['Shweta', 12, 'Agra']], dtype=object)

In [50]:
## Creating the dataframe fromlist of dictionary

data=[
    {'Name':'Ankit','Age':21,'city':'Agra'},
    {'Name':'Prakruti','Age':19,'city':'Puri'},
    {'Name':'Shweta','Age':12,'city':'Agra'},
]

In [51]:
df=pd.DataFrame(data)
print(df)
print(type(df))

       Name  Age  city
0     Ankit   21  Agra
1  Prakruti   19  Puri
2    Shweta   12  Agra
<class 'pandas.core.frame.DataFrame'>

In [16]:
df=pd.read_csv('final_dataset.csv')
df.head()

,Date,Month,Year,Holidays_Count,Days,PM2.5,PM10,NO2,SO2,CO,Ozone,AQI
0,1,1,2021,0,5,408.80,442.42,160.61,12.95,2.77,43.19,462
1,2,1,2021,0,6,404.04,561.95,52.85,5.18,2.60,16.43,482
2,3,1,2021,1,7,225.07,239.04,170.95,10.93,1.40,44.29,263
3,4,1,2021,0,1,89.55,132.08,153.98,10.42,1.01,49.19,207
4,5,1,2021,0,2,54.06,55.54,122.66,9.70,0.64,48.88,149

In [17]:
df.tail()

,Date,Month,Year,Holidays_Count,Days,PM2.5,PM10,NO2,SO2,CO,Ozone,AQI
1456,27,12,2024,0,5,58.43,249.17,41.69,65.89,0.99,36.25,263
1457,28,12,2024,0,6,33.83,150.77,33.31,66.14,0.79,35.19,113
1458,29,12,2024,1,7,31.21,139.75,27.01,65.94,0.57,35.88,142
1459,30,12,2024,0,1,38.01,152.83,29.12,65.16,0.55,38.38,116
1460,31,12,2024,0,2,80.42,318.96,40.37,64.98,0.84,39.93,209

In [11]:
## Accessing data from dataframe
df

,Date,Month,Year,Holidays_Count,Days,PM2.5,PM10,NO2,SO2,CO,Ozone,AQI
0,1,1,2021,0,5,408.80,442.42,160.61,12.95,2.77,43.19,462
1,2,1,2021,0,6,404.04,561.95,52.85,5.18,2.60,16.43,482
2,3,1,2021,1,7,225.07,239.04,170.95,10.93,1.40,44.29,263
3,4,1,2021,0,1,89.55,132.08,153.98,10.42,1.01,49.19,207
4,5,1,2021,0,2,54.06,55.54,122.66,9.70,0.64,48.88,149
...,...,...,...,...,...,...,...,...,...,...,...,...
1456,27,12,2024,0,5,58.43,249.17,41.69,65.89,0.99,36.25,263
1457,28,12,2024,0,6,33.83,150.77,33.31,66.14,0.79,35.19,113
1458,29,12,2024,1,7,31.21,139.75,27.01,65.94,0.57,35.88,142
1459,30,12,2024,0,1,38.01,152.83,29.12,65.16,0.55,38.38,116
1460,31,12,2024,0,2,80.42,318.96,40.37,64.98,0.84,39.93,209

In [25]:
## Picking Up the Colom index
df['Name']

0       Ankit
1    Prakruti
2      Shweta
Name: Name, dtype: object

In [22]:
## Picking Up the row index
df.loc[0]

Name    Ankit
Age        21
city     Agra
Name: 0, dtype: object

In [21]:
df.iloc[0]

Name    Ankit
Age        21
city     Agra
Name: 0, dtype: object

In [24]:
## Accessing a specified element
df['Name']

0       Ankit
1    Prakruti
2      Shweta
Name: Name, dtype: object

In [28]:
df.at[1,'Name']

'Prakruti'

In [31]:
## Accessing specified element using iat
df.iat[1,2]

'Puri'

In [33]:
### Data Manipulation with dataframe
df

       Name  Age  city
0     Ankit   21  Agra
1  Prakruti   19  Puri
2    Shweta   12  Agra

In [38]:
## Adding a colom in dataframe
df['Education']=['B.Tech','BA','8th']
df

       Name  Age  city Education
0     Ankit   21  Agra    B.Tech
1  Prakruti   19  Puri        BA
2    Shweta   12  Agra       8th

In [43]:
## Removing the colom
df.drop('Education',axis=1) ## asxis=1 tells that it should check the colom index not row index which is by default
## It just the temparory operation

#To make it permanent you need to do inplace true
df.drop('Education',axis=1,inplace=True)

In [48]:
df

       Name  Age  city
0     Ankit   24  Agra
1  Prakruti   22  Puri
2    Shweta   15  Agra

In [52]:
## Add age to the colom
df['Age']=df['Age']+1
df

       Name  Age  city
0     Ankit   22  Agra
1  Prakruti   20  Puri
2    Shweta   13  Agra

In [54]:
df.drop(0,inplace=False)

       Name  Age  city
1  Prakruti   20  Puri
2    Shweta   13  Agra

In [55]:
df

       Name  Age  city
0     Ankit   22  Agra
1  Prakruti   20  Puri
2    Shweta   13  Agra

In [59]:
df.head(2)

       Name  Age  city
0     Ankit   22  Agra
1  Prakruti   20  Puri

In [60]:
df.describe()

             Age
count   3.000000
mean   18.333333
std     4.725816
min    13.000000
25%    16.500000
50%    20.000000
75%    21.000000
max    22.000000

In [61]:
df2=pd.read_csv('final_dataset.csv')

In [62]:
df2.head()

,Date,Month,Year,Holidays_Count,Days,PM2.5,PM10,NO2,SO2,CO,Ozone,AQI
0,1,1,2021,0,5,408.80,442.42,160.61,12.95,2.77,43.19,462
1,2,1,2021,0,6,404.04,561.95,52.85,5.18,2.60,16.43,482
2,3,1,2021,1,7,225.07,239.04,170.95,10.93,1.40,44.29,263
3,4,1,2021,0,1,89.55,132.08,153.98,10.42,1.01,49.19,207
4,5,1,2021,0,2,54.06,55.54,122.66,9.70,0.64,48.88,149

In [63]:
df2.describe()

,Date,Month,Year,Holidays_Count,Days,PM2.5,PM10,NO2,SO2,CO,Ozone,AQI
count,1461.000000,1461.000000,1461.000000,1461.000000,1461.000000,1461.000000,1461.000000,1461.000000,1461.000000,1461.000000,1461.000000,1461.000000
mean,15.729637,6.522930,2022.501027,0.189596,4.000684,90.774538,218.219261,37.184921,20.104921,1.025832,36.338871,202.210815
std,8.803105,3.449884,1.118723,0.392116,2.001883,71.650579,129.297734,35.225327,16.543659,0.608305,18.951204,107.801076
min,1.000000,1.000000,2021.000000,0.000000,1.000000,0.050000,9.690000,2.160000,1.210000,0.270000,2.700000,19.000000
25%,8.000000,4.000000,2022.000000,0.000000,2.000000,41.280000,115.110000,17.280000,7.710000,0.610000,24.100000,108.000000
50%,16.000000,7.000000,2023.000000,0.000000,4.000000,72.060000,199.800000,30.490000,15.430000,0.850000,32.470000,189.000000
75%,23.000000,10.000000,2024.000000,0.000000,6.000000,118.500000,297.750000,45.010000,26.620000,1.240000,45.730000,284.000000
max,31.000000,12.000000,2024.000000,1.000000,7.000000,1000.000000,1000.000000,433.980000,113.400000,4.700000,115.870000,500.000000